app/controllers/donate_education_materials_controller.rb

  def index
    @donate_education_materials = DonateEducationMaterial.all
---
SELECT "donate_education_materials".* FROM "donate_education_materials"

    def set_donate_education_material
      @donate_education_material = DonateEducationMaterial.find(params[:id])
---
SELECT  "donate_education_materials".* FROM "donate_education_materials" WHERE "donate_education_materials"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]