app/controllers/maa_addresses_controller.rb

SELECT "maa_addresses".* FROM "maa_addresses"
---
  def index
    @maa_addresses = MaaAddress.all

SELECT  "maa_addresses".* FROM "maa_addresses" WHERE "maa_addresses"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_maa_address
      @maa_address = MaaAddress.find(params[:id])