app/controllers/programs_controller.rb

  def index
    @programs = Program.all
---
SELECT "programs".* FROM "programs"

  def create
    @program = Program.new(program_params)

    respond_to do |format|
      if @program.save
---
INSERT INTO "programs" ("Event_Name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["Event_Name", "MyString"], ["created_at", 2016-10-13 06:36:58 UTC], ["updated_at", 2016-10-13 06:36:58 UTC]]

  def destroy
    @program.destroy
---
DELETE FROM "programs" WHERE "programs"."id" = $1  [["id", 1]]

  def set_program
    @program = Program.find(params[:id])
---
SELECT  "programs".* FROM "programs" WHERE "programs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]