app/controllers/regs_controller.rb

SELECT "regs".* FROM "regs"
---
  def index
    @reg = Reg.all

SELECT  "regs".* FROM "regs" WHERE "regs"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
  def set_reg
    @reg = Reg.find(params[:id])