app/controllers/userpersnaldets_controller.rb

    def set_userpersnaldet
      @userpersnaldet = Userpersnaldet.find(params[:id])
---
SELECT  "userpersnaldets".* FROM "userpersnaldets" WHERE "userpersnaldets"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]